mathFonseca/CSW41/Laboratório 3 - Maria e Matheus F/_Exemplo_UTFPR_TM4C1294XL_BoosterPackMKII/ProjectFiles/exemploTIVA.c
/*============================================================================
 *                    Exemplos de utilização do Kit
 *              EK-TM4C1294XL + Educational BooterPack MKII 
 *---------------------------------------------------------------------------*
 *                    Prof. André Schneider de Oliveira
 *            Universidade Tecnológica Federal do Paraná (UTFPR)
 *===========================================================================
 * Autores das bibliotecas:
 * 		Allan Patrick de Souza - <allansouza@alunos.utfpr.edu.br>
 * 		Guilherme Jacichen     - <jacichen@alunos.utfpr.edu.br>
 * 		Jessica Isoton Sampaio - <jessicasampaio@alunos.utfpr.edu.br>
 * 		Mariana Carrião        - <mcarriao@alunos.utfpr.edu.br>
 *===========================================================================*/
#include "cmsis_os.h"
#include "TM4C129.h"                    // Device header
#include <stdbool.h>
#include "grlib/grlib.h"

/*----------------------------------------------------------------------------
 * include libraries from drivers
 *----------------------------------------------------------------------------*/

#include "rgb.h"
#include "cfaf128x128x16.h"
#include "servo.h"
#include "temp.h"
#include "opt.h"
#include "buttons.h"
#include "buzzer.h"
#include "joy.h"
#include "mic.h"
#include "accel.h"
#include "led.h"
#include "EddieV3.h"
#include "Background.h"
#include "Background2.h"
#include "inimigo.h"
#include "point.h"
#include "boss.h"
#include "key.h"

#define LED_A      0
#define LED_B      1
#define LED_C      2
#define LED_D      3
#define LED_CLK    7
#define EDDIE_WIDTH 8
#define EDDIE_HEIGHT 15
#define EDDIE_PASSO 4
#define EDDIE_PASSO_JUMPING 3

#define ESCADA_WIDTH 22
#define ESCADA_HEIGHT 20
#define ESCADA_COUNTER 4

#define ENEMY_WIDTH 5
#define ENEMY_HEIGHT 5
#define ENEMIES_COUNTER 4

#define BOSS_HEIGHT 9
#define BOSS_WIDTH 5

#define POINT_WIDTH 5
#define POINT_HEIGHT 5
#define POINT_COUNTER 2

#define KEY_WIDTH 5
#define KEY_HEIGHT 4

#define INICIO_Y 30
#define MARGEM_ESQUERDA 3 
#define MAXLEVEL 2

#define TIMER_EDDIE 500
//To print on the screen
tContext sContext;

//escadas
uint32_t escadas_x[ESCADA_COUNTER];
uint32_t escadas_y[ESCADA_COUNTER];
//Eddie
uint32_t Eddie_x;
uint32_t Eddie_y;
bool going_up;
uint8_t going_up_counter;
bool going_down;
uint8_t going_down_counter;
bool jumping;
uint8_t jumping_counter;
uint8_t jumping_side; //0=parado, 1=direita, 2=esquerda
//enemies
uint32_t enemies_x[ENEMIES_COUNTER];
uint32_t enemies_y[ENEMIES_COUNTER];
uint8_t enemies_side[ENEMIES_COUNTER];//0=parado, 1=direita, 2=esquerda
//Boss
uint32_t Boss_x;
uint32_t Boss_y;
uint32_t Key_y;
uint8_t Boss_side;

//POINTS
uint32_t points_x[POINT_COUNTER];
uint32_t points_y[POINT_COUNTER];
bool points_move[POINT_COUNTER];

//game controller
uint8_t level;
uint8_t points;
uint8_t boss_height;
uint8_t lives;
uint16_t score;
bool game_over;
bool game_won;
bool onPause;

void init_all();
void Initialize();
void OnPause();
void InitializeBackGround();
void GameController();
void EddieController();
void EnemiesController();
void PointsController();
void BossController();

osThreadDef(GameController, osPriorityNormal, 1, 0);
osTimerDef(timer_eddie, EddieController);
osTimerDef(timer_enemies, EnemiesController);
osTimerDef(timer_points, PointsController);
osTimerDef(timer_boss, BossController); 
osTimerId t_eddie;
osTimerId	t_enemies;
osTimerId	t_points;
osTimerId	t_boss;

int main (void) {

  //uint32_t color = 0x00, i, j, pixel,pixel_ed;
	osKernelInitialize();
	t_eddie = osTimerCreate(osTimer(timer_eddie), osTimerPeriodic, (void *)0);
	t_enemies = osTimerCreate(osTimer(timer_enemies), osTimerPeriodic, (void *)1);
	t_points = osTimerCreate(osTimer(timer_points), osTimerPeriodic, (void *)2);
	t_boss = osTimerCreate(osTimer(timer_boss), osTimerPeriodic, (void *)3);
	init_all();
	Initialize();
	OnPause();
	InitializeBackGround();
	
	osThreadCreate(osThread(GameController), NULL);
	

	osTimerStart(t_eddie, TIMER_EDDIE);
	osKernelStart();
	osDelay(osWaitForever);
}

static void intToString(int64_t value, char * pBuf, uint32_t len, uint32_t base, uint8_t zeros){
	static const char* pAscii = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	bool n = false;
	int pos = 0, d = 0;
	int64_t tmpValue = value;

	// the buffer must not be null and at least have a length of 2 to handle one
	// digit and null-terminator
	if (pBuf == NULL || len < 2)
			return;

	// a valid base cannot be less than 2 or larger than 36
	// a base value of 2 means binary representation. A value of 1 would mean only zeros
	// a base larger than 36 can only be used if a larger alphabet were used.
	if (base < 2 || base > 36)
			return;

	if (zeros > len)
		return;
	
	// negative value
	if (value < 0)
	{
			tmpValue = -tmpValue;
			value    = -value;
			pBuf[pos++] = '-';
			n = true;
	}

	// calculate the required length of the buffer
	do {
			pos++;
			tmpValue /= base;
	} while(tmpValue > 0);


	if (pos > len)
			// the len parameter is invalid.
			return;

	if(zeros > pos){
		pBuf[zeros] = '\0';
		do{
			pBuf[d++ + (n ? 1 : 0)] = pAscii[0]; 
		}
		while(zeros > d + pos);
	}
	else
		pBuf[pos] = '\0';

	pos += d;
	do {
			pBuf[--pos] = pAscii[value % base];
			value /= base;
	} while(value > 0);
}

static void floatToString(float value, char *pBuf, uint32_t len, uint32_t base, uint8_t zeros, uint8_t precision){
	static const char* pAscii = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	uint8_t start = 0xFF;
	if(len < 2)
		return;
	
	if (base < 2 || base > 36)
		return;
	
	if(zeros + precision + 1 > len)
		return;
	
	intToString((int64_t) value, pBuf, len, base, zeros);
	while(pBuf[++start] != '\0' && start < len); 

	if(start + precision + 1 > len)
		return;
	
	pBuf[start+precision+1] = '\0';
	
	if(value < 0)
		value = -value;
	pBuf[start++] = '.';
	while(precision-- > 0){
		value -= (uint32_t) value;
		value *= (float) base;
		pBuf[start++] = pAscii[(uint32_t) value];
	}
}


void init_all(){
	cfaf128x128x16Init();
	joy_init();
	accel_init();
	buzzer_init(); 
	button_init();
	mic_init();
	rgb_init();
	servo_init();
	temp_init();
	opt_init();
	led_init();
}


