mathFonseca/CSW41/Laboratório 3 - Maria e Matheus F/_Exemplo_UTFPR_TM4C1294XL_BoosterPackMKII/ProjectFiles/exemploTIVA.c
void draw_pixel(uint16_t x, uint16_t y){
	GrPixelDraw(&sContext, x, y);
}

void draw_Eddie(uint16_t x, uint16_t y){
	uint32_t i, j;
	uint32_t color, pixel=0;

	for(j=y; j<y+EDDIE_HEIGHT; j++){ //y
			for(i=x; i<x+EDDIE_WIDTH; i++){//x
					pixel = Eddie_start+3*((j-y)*EDDIE_WIDTH+i-x);
					color = 0x00;
					color += Eddie[pixel+2];
					color += Eddie[pixel+1]*16*16;
					color += Eddie[pixel]*16*16*16*16;
					color += 0x00*16*16*16*16*16*16;
					GrContextForegroundSet(&sContext, color);
					if(color!=ClrBlack)
						draw_pixel(i, j);
			}
	}
}

void draw_Enemy(uint16_t x, uint16_t y){
	uint32_t i, j;
	uint32_t color, pixel=0;

	for(j=y; j<y+ENEMY_HEIGHT; j++){ //y
			for(i=x; i<x+ENEMY_WIDTH; i++){//x
					pixel = inimigo_start+3*((j-y)*ENEMY_WIDTH+i-x);
					color = 0x00;
					color += inimigo[pixel+2];
					color += inimigo[pixel+1]*16*16;
					color += inimigo[pixel]*16*16*16*16;
					color += 0x00*16*16*16*16*16*16;
					GrContextForegroundSet(&sContext, color);
					if(color!=ClrBlack)
						draw_pixel(i, j);
			}
	}
}

void draw_Boss(uint16_t x, uint16_t y){
	uint32_t i, j;
	uint32_t color, pixel=0;
	uint8_t extra = points;
	if(extra>4)
			extra = 4;
	
	for(j=y; j<y+BOSS_HEIGHT-extra; j++){ //y
			for(i=x; i<x+BOSS_WIDTH; i++){//x
					pixel = boss_start+3*((j-y)*BOSS_WIDTH+i-x);
					color = 0x00;
					color += boss[pixel+2];
					color += boss[pixel+1]*16*16;
					color += boss[pixel]*16*16*16*16;
					color += 0x00*16*16*16*16*16*16;
					GrContextForegroundSet(&sContext, color);
					if(color!=ClrBlack)
						draw_pixel(i, j);
			}
	}
}

void draw_Point(uint16_t x, uint16_t y){
	uint32_t i, j;
	uint32_t color, pixel=0;

	for(j=y; j<y+POINT_HEIGHT; j++){ //y
			for(i=x; i<x+POINT_WIDTH; i++){//x
					pixel = point_start+3*((j-y)*POINT_WIDTH+i-x);
					color = 0x00;
					color += point[pixel+2];
					color += point[pixel+1]*16*16;
					color += point[pixel]*16*16*16*16;
					color += 0x00*16*16*16*16*16*16;
					GrContextForegroundSet(&sContext, color);
					if(color!=ClrBlack)
						draw_pixel(i, j);
			}
	}
}
void draw_Key(uint16_t x, uint16_t y){
	uint32_t i, j;
	uint32_t color, pixel=0;

	for(j=y; j<y+KEY_HEIGHT; j++){ //y
			for(i=x; i<x+KEY_WIDTH; i++){//x
					pixel = key_start+3*((j-y)*KEY_WIDTH+i-x);
					color = 0x00;
					color += key[pixel+2];
					color += key[pixel+1]*16*16;
					color += key[pixel]*16*16*16*16;
					color += 0x00*16*16*16*16*16*16;
					GrContextForegroundSet(&sContext, ClrYellow);
					if(color!=ClrBlack)
						draw_pixel(i, j);
			}
	}
}


void drawBack(uint16_t x, uint16_t y,uint16_t width, uint16_t height){
	uint32_t i, j;
	uint32_t color, pixel;
	
	for(j=y; j<y+height; j++){ //y
		for(i=x; i<x+width; i++){//x
				if(level==1){
						if(j<=INICIO_Y){
								GrContextForegroundSet(&sContext, ClrBlack);
						}
						else{
								pixel = Background_start+3*((j- INICIO_Y)*128+i);
								color = 0x00;
								color += Background[pixel+2];
								color += Background[pixel+1]*16*16;
								color += Background[pixel]*16*16*16*16;
								color += 0x00*16*16*16*16*16*16;
								GrContextForegroundSet(&sContext, color);
								//GrContextForegroundSet(&sContext, ClrBlueViolet);		
						}
						draw_pixel(i, j);
				}
				else if(level==2){
						pixel = Background2_start+3*((j)*128+i);
						color = 0x00;
						color += Background2[pixel+2];
						color += Background2[pixel+1]*16*16;
						color += Background2[pixel]*16*16*16*16;
						color += 0x00*16*16*16*16*16*16;
						GrContextForegroundSet(&sContext, color);	
						draw_pixel(i, j);
				}
				
		}
	}
}
void draw(uint8_t id, uint16_t x, uint16_t y, uint16_t last_x, uint16_t last_y, uint8_t key_y, uint8_t last_key_y){
		
		/*id: 0 - drawBack
					1 - draw_Eddie
					2 - draw_Enemy
					3 - draw_Point 
					4 - draw_Boss && draw_Key	*/
		
		if(id==0){// caso precise no futuro
		}
		else if (id==1){
				if(last_x!=x || last_y!=y)
					drawBack(last_x, last_y, EDDIE_WIDTH, EDDIE_HEIGHT);		
				draw_Eddie(x, y);		
		}
		else if (id==2){
				if(last_x!=x || last_y!=y)
					drawBack(last_x, last_y, ENEMY_WIDTH, ENEMY_HEIGHT);		
				draw_Enemy(x, y);		
		}
		else if (id==3){
				if(last_x!=x || last_y!=y)
					drawBack(last_x, last_y, POINT_WIDTH, POINT_HEIGHT);		
				draw_Point(x, y);		
		}
		else if (id==4){
				if(last_x != x || last_y != y){
						drawBack(last_x, last_y, BOSS_WIDTH, BOSS_HEIGHT);
						drawBack(last_x, last_key_y, KEY_WIDTH, KEY_HEIGHT);
				}
				draw_Boss(x,y);			
				draw_Key(x,Key_y);
		}
}

void draw_circle(uint16_t x, uint16_t y){
	GrCircleDraw(&sContext, 
		(sContext.psFont->ui8MaxWidth)*x + (sContext.psFont->ui8MaxWidth)/2, 
		(sContext.psFont->ui8Height+2)*y + sContext.psFont->ui8Height/2 - 1, 
		(sContext.psFont->ui8MaxWidth)/2);
}

void fill_circle(uint16_t x, uint16_t y){
	GrCircleFill(&sContext, 
		(sContext.psFont->ui8MaxWidth)*x + sContext.psFont->ui8MaxWidth/2, 
		(sContext.psFont->ui8Height+2)*y + sContext.psFont->ui8Height/2 - 1, 
		(sContext.psFont->ui8MaxWidth)/2-1);
}

uint32_t saturate(uint8_t r, uint8_t g, uint8_t b){
	uint8_t *max = &r, 
					*mid = &g, 
					*min = &b,
					*aux, 
					div, num;
	if (*mid > *max){ aux = max; max = mid; mid = aux; }
	if (*min > *mid){ aux = mid; mid = min; min = aux; }
	if (*mid > *max){	aux = max; max = mid; mid = aux; }
	if(*max != *min){
		div = *max-*min;
		num = *mid-*min;
		*max = 0xFF;
		*min = 0x00;
		*mid = (uint8_t) num*0xFF/div;
	}
	return 	(((uint32_t) r) << 16) | 
					(((uint32_t) g) <<  8) | 
					( (uint32_t) b       );
}

bool button_read_debounce(void) {
	uint8_t i = 0;
	while(i < 50) {
		if(button_read_s1())
			i++;
		else
			return false;
	}
	return true;
}
void InitializeBackGround(){
		uint32_t color = 0x00, i, j, pixel;
	
		if(level==1){
				pixel = Background_start;
				for(j = INICIO_Y; j < 128; j++){ //y
					for(i = 0; i < 128; i++){ //x
						//pixel = Background_start+3*((j-INICIO_Y)*128+i);
						color = 0x00;
						color += Background[pixel+2];
						color += Background[pixel+1]*16*16;
						color += Background[pixel]*16*16*16*16;
						color += 0x00*16*16*16*16*16*16;
						GrContextForegroundSet(&sContext, color);
						draw_pixel(i, j);
						pixel += 3;
					}
				}
		}
		else if(level==2){
				pixel = Background2_start;
				for(j = 0; j < 128; j++){ //y
						for(i = 0; i < 128; i++){ //x
							color = 0x00;
							color += Background2[pixel+2];
							color += Background2[pixel+1]*16*16;
							color += Background2[pixel]*16*16*16*16;
							color += 0x00*16*16*16*16*16*16;
							GrContextForegroundSet(&sContext, color);
							draw_pixel(i, j);
							pixel += 3;
						}
				}
		}
}
void InitializeBacKGround(){
		uint32_t color = 0x00, i, j, pixel,pixel_ed;
		
		pixel = Background_start;
		for(j = INICIO_Y; j < 128; j++){ //y
			for(i = 0; i < 128; i++){ //x
				//pixel = Background_start+3*((j-INICIO_Y)*128+i);
				color = 0x00;
				color += Background[pixel+2];
				color += Background[pixel+1]*16*16;
				color += Background[pixel]*16*16*16*16;
				color += 0x00*16*16*16*16*16*16;
				GrContextForegroundSet(&sContext, color);
				draw_pixel(i, j);
				pixel += 3;
			}
		}

