mathFonseca/CSW41/Laboratório 3 - Maria e Matheus F/_Exemplo_UTFPR_TM4C1294XL_BoosterPackMKII/ProjectFiles/exemploTIVA.c
}

void Initialize(){

		escadas_x[0] = 100;
		escadas_x[1] = 5;
		escadas_x[2] = 80;
		escadas_x[3] = 10;
	
		escadas_y[0] = 35;
		escadas_y[1] = 58;
		escadas_y[2] = 80;
		escadas_y[3] = 103;
		
	//enemies_side: 0=parado, 1=direita, 2=esquerda
		enemies_x[0] = 20;
		enemies_y[0] = 55-ENEMY_HEIGHT;
		enemies_side[0] = 2;
		enemies_x[1] = 40;
		enemies_y[1] = 55-ENEMY_HEIGHT+23;
		enemies_side[1] = 1;
		enemies_x[2] = 60;
		enemies_y[2] = 55-ENEMY_HEIGHT+46;
		enemies_side[2] = 0;
		enemies_x[3] = 10;
		enemies_y[3] = 55-ENEMY_HEIGHT+69;
		enemies_side[3] = 2;
		
		//POINTS
		points_x[0] = 35;
		points_y[0] = 35;
		points_move[0] = false;
		points_x[1] = 35;
		points_y[1] = 35+46;
		points_move[0] = true;
	
		Eddie_x = 115;
		Eddie_y = 124-EDDIE_HEIGHT;
		
		Boss_x = (128-MARGEM_ESQUERDA)/2+MARGEM_ESQUERDA;
		Boss_y = 33-BOSS_HEIGHT;
		Key_y = Boss_y - KEY_HEIGHT;
		Boss_side = 1;
		
		level = 1;
		points = 0;
		boss_height = 10;
		lives = 5;
		score=0;
		game_over = false;
		game_won = false;
		//onPause = false;
		
		jumping = false;
		jumping_counter = 0;
		jumping_side = 0;
		going_up = false;
		going_up = false;
		going_up_counter = 0;
		going_down_counter = 0;
	
		GrContextInit(&sContext, &g_sCfaf128x128x16);
		GrFlush(&sContext);
		GrContextFontSet(&sContext, g_psFontFixed6x8);
		
		
}
bool collisionStairsControllerUp(){
		uint8_t i;
		for(i=0; i<ESCADA_COUNTER ; i++){
				if(Eddie_x+EDDIE_WIDTH>escadas_x[i] && Eddie_x<escadas_x[i]+ESCADA_WIDTH && Eddie_y+EDDIE_HEIGHT>escadas_y[i] && Eddie_y<escadas_y[i]+ESCADA_HEIGHT){
						return true;
				}
		}
		return false;
}
bool collisionStairsControllerDown(){
		uint8_t i;
		for(i=0; i<ESCADA_COUNTER ; i++){
				if(Eddie_x+EDDIE_WIDTH>escadas_x[i] && Eddie_x<escadas_x[i]+ESCADA_WIDTH && Eddie_y+EDDIE_HEIGHT+4>escadas_y[i] && Eddie_y<escadas_y[i]){
						return true;
				}
		}	
		return false;
}
void EddieController(){
		uint16_t x, y;
		char pbufx[10], pbufy[10];
		bool jumping_button, may_go_up,may_go_down;
		uint32_t Eddie_last_x;
		uint32_t Eddie_last_y;
	
		//if(!onPause){
				Eddie_last_x = Eddie_x;
				Eddie_last_y = Eddie_y;
				may_go_up = collisionStairsControllerUp();
				may_go_down = collisionStairsControllerDown();
				if(going_up==false && going_down==false && jumping==false){
						x = 0.0048*joy_read_x();
						y = -0.0029*joy_read_y() + 12;
						jumping_button = button_read_debounce();
					
						if(jumping_button){	//jumping_side: 0=parado, 1=direita, 2=esquerda
								jumping=true;
								if(x>13){jumping_side=1;}
								else if(x<5){jumping_side=2;}
								else{jumping_side=0;}
						}
						if(jumping_button==false){
								if(x>13 && Eddie_x+EDDIE_PASSO<128-EDDIE_WIDTH){
										Eddie_x+=EDDIE_PASSO;
								}
								if(x<5 && Eddie_x-EDDIE_PASSO>MARGEM_ESQUERDA){
										Eddie_x-=EDDIE_PASSO;
								}
								if(y>8 && may_go_down){
										going_down = true;
								}
								if(y<3 && may_go_up){
										going_up = true;
								}
								
						}
				}
				
				else if(jumping){
						if(jumping_counter<8){
								if(jumping_counter==0 || jumping_counter==1 ){Eddie_y -=EDDIE_PASSO_JUMPING;}
								else if(jumping_counter==6 || jumping_counter==7 ){Eddie_y +=EDDIE_PASSO_JUMPING;}
								
								if(jumping_side==1 && Eddie_x+EDDIE_PASSO<128-EDDIE_WIDTH){Eddie_x += EDDIE_PASSO;}
								else if(jumping_side==  2 && Eddie_x-EDDIE_PASSO>MARGEM_ESQUERDA){Eddie_x -= EDDIE_PASSO;}
								
								jumping_counter++;
						}
						else{
								jumping_counter=0;
								jumping_side=0;
								jumping= false;
						}
				}
				else if(going_down){
						if(going_down_counter<5){
								Eddie_y +=EDDIE_PASSO;
								going_down_counter++;
						}
						else{
								Eddie_y +=EDDIE_PASSO-1;
								going_down_counter=0;
								going_down = false;
						}
				}
				else if(going_up){
						if(going_up_counter<5){
								Eddie_y -=EDDIE_PASSO;
								going_up_counter++;
						}
						else{
								Eddie_y -=EDDIE_PASSO-1;
								going_up_counter=0;
								going_up = false;
						}
				}
				
				//if(Eddie_last_x!=Eddie_x || Eddie_last_y!=Eddie_y){
				//	drawBack(Eddie_last_x, Eddie_last_y, EDDIE_WIDTH, EDDIE_HEIGHT);		
				//}
				//draw_Eddie(Eddie_x, Eddie_y);		
				draw(1,Eddie_x, Eddie_y, Eddie_last_x, Eddie_last_y, 0, 0);
		//}
}


void EnemiesController(){
		uint16_t x, y, i;
		
		uint32_t enemies_last_x[ENEMIES_COUNTER] ;
		uint32_t enemies_last_y[ENEMIES_COUNTER] ;
		//if(!onPause){
				for(i=0; i<ENEMIES_COUNTER; i++){
						enemies_last_x[i] = enemies_x[i];
						enemies_last_y[i] = enemies_y[i];
					
						if(enemies_side[i]==1){
								if(enemies_x[i]+EDDIE_PASSO<128-ENEMY_WIDTH){enemies_x[i]+=EDDIE_PASSO;}
								else{enemies_side[i]=2;}			
						}
						else if(enemies_side[i]==2){
								if(enemies_x[i]-EDDIE_PASSO>MARGEM_ESQUERDA){enemies_x[i]-=EDDIE_PASSO;}						
								else{enemies_side[i]=1;}			
						}
						
						//if(enemies_last_x[i] != enemies_x[i] || enemies_last_y[i] != enemies_y[i]){
						//	drawBack(enemies_last_x[i], enemies_last_y[i], ENEMY_WIDTH, ENEMY_HEIGHT);		
						//}		
						//draw_Enemy(enemies_x[i],enemies_y[i]);
						draw(2, enemies_x[i],enemies_y[i],enemies_last_x[i], enemies_last_y[i], 0, 0);
				}		
		//}
}


void PointsController(){
		uint16_t  i;
		
		uint32_t points_last_x[POINT_COUNTER] ;
		uint32_t points_last_y[POINT_COUNTER] ;
		//if(!onPause){
				for(i=0; i<POINT_COUNTER; i++){
						points_last_x[i] = points_x[i];
						points_last_y[i] = points_y[i];
					
						if(points_move[i]==true){
								if(points_x[i]+EDDIE_PASSO<128-POINT_WIDTH){points_x[i]+=EDDIE_PASSO;}
								else{	points_x[i] = 0;}			
						}
						
						//if(points_last_x[i] != points_x[i] || points_last_y[i] != points_y[i]){
						//	drawBack(points_last_x[i], points_last_y[i], POINT_WIDTH, POINT_HEIGHT);		
						//}		
						//draw_Point(points_x[i],points_y[i]);
						draw(3, points_x[i],points_y[i], points_last_x[i], points_last_y[i], 0, 0);
				}
		//}		
}


void BossController(){
		uint16_t x, y, i;
		uint8_t extra=0;
		uint32_t boss_last_x;
		uint32_t boss_last_y;
		uint32_t key_last_y;
	
		//if(!onPause){
				boss_last_x = Boss_x;
				boss_last_y = Boss_y;
				key_last_y = Key_y;
			
