mathFonseca/CSW41/Laboratório 3 - Maria e Matheus F/_Exemplo_UTFPR_TM4C1294XL_BoosterPackMKII/ProjectFiles/exemploTIVA.c
				if(Boss_side==1){
						if(Boss_x+EDDIE_PASSO<128-BOSS_WIDTH){Boss_x+=EDDIE_PASSO;}
						else{Boss_side=2;}			
				}
				else if(Boss_side==2){
						if(Boss_x-EDDIE_PASSO>MARGEM_ESQUERDA){Boss_x-=EDDIE_PASSO;}						
						else{Boss_side=1;}			
				}
				
				extra = points;
				if(extra>4)
						extra = 4;
				Boss_y = 33-BOSS_HEIGHT+extra;
				Key_y = Boss_y-KEY_HEIGHT;
				
				//if(boss_last_x != Boss_x || boss_last_y != Boss_y){
				//	drawBack(boss_last_x, boss_last_y, BOSS_WIDTH, BOSS_HEIGHT);
				//	drawBack(boss_last_x, key_last_y, KEY_WIDTH, KEY_HEIGHT);
				//}
				//draw_Boss(Boss_x,Boss_y);			
				//draw_Key(Boss_x,Key_y);
				draw(4,Boss_x,Boss_y,boss_last_x, boss_last_y,Key_y,key_last_y );
		//}
}
		

uint8_t collisionEnemyController(){
		uint8_t i;
		for(i=0; i<ENEMIES_COUNTER; i++){
				if(Eddie_x+EDDIE_WIDTH>enemies_x[i] && Eddie_x<enemies_x[i]+ENEMY_WIDTH && Eddie_y+EDDIE_HEIGHT>enemies_y[i] && Eddie_y<enemies_y[i]+ENEMY_HEIGHT){
					return i;
				}
		}
		return 10; //codigo de erro
}

uint8_t collisionPointController(){
		uint8_t i;
		for(i=0; i<POINT_COUNTER; i++){
				if(Eddie_x+EDDIE_WIDTH>points_x[i] && Eddie_x<points_x[i]+POINT_WIDTH && Eddie_y+EDDIE_HEIGHT>points_y[i] && Eddie_y<points_y[i]+POINT_HEIGHT){
						return i;
				}
		}	
		return 10; //codigo de erro
}

bool collisionKeyController(){
		uint8_t i;
		if(Eddie_x+EDDIE_WIDTH>Boss_x && Eddie_x<Boss_x+KEY_WIDTH && Eddie_y+EDDIE_HEIGHT>Key_y && Eddie_y<Key_y+KEY_HEIGHT){
				return true;
		}
		return false;
}
bool collisionBossController(){
		uint8_t i;
		uint8_t boss_h;
		uint8_t extra = points;
		if(extra>4)
				extra = 4;
		boss_h = BOSS_HEIGHT-extra;
		if(Eddie_x+EDDIE_WIDTH>Boss_x && Eddie_x<Boss_x+BOSS_WIDTH && Eddie_y+EDDIE_HEIGHT>Boss_y && Eddie_y<Boss_y+boss_h){
				return true;
		}
		return false;
}


void ResetEddie(){
		//drawBack(Eddie_x, Eddie_y, EDDIE_WIDTH,EDDIE_HEIGHT);
		uint16_t last_x,last_y;
		last_x = Eddie_x;
		last_y = Eddie_y;
		Eddie_x = 115;
		Eddie_y = 124-EDDIE_HEIGHT;
		draw(1,Eddie_x, Eddie_y,last_x,last_y,0,0);
		
		jumping = false;
		jumping_counter = 0;
		jumping_side = 0;
		going_up = false;
		going_up = false;
		going_up_counter = 0;
		going_down_counter = 0;
}
void newPointPosition(uint8_t id){
		uint8_t new_x, new_y;
		//drawBack(points_x[id], points_y[id], ENEMY_WIDTH, ENEMY_HEIGHT);
		new_x = (score*points_x[id]/13)%120+MARGEM_ESQUERDA; 
		new_y = points_y[id]+23;
		if(new_y > 110){
				new_y = 35;
		}
		draw(3,new_x,new_y, points_x[id], points_y[id], 0,0 );
		points_x[id] = new_x;
		points_y[id] = new_y;
	
}
void newEnemyPosition(uint8_t id){
		//drawBack(enemies_x[id], enemies_x[id], ENEMY_WIDTH, ENEMY_HEIGHT);
		uint16_t last_x = enemies_x[id];
		if(enemies_side[id]!=0){
				uint8_t new_x = (score*enemies_x[id]/(id+1))%120+MARGEM_ESQUERDA; 
				enemies_x[id] = new_x;
				
		}
		draw(2,enemies_x[id],enemies_y[id], last_x,enemies_y[id], 0,0 );
		
}
void InitializeNewLevel(){
		uint8_t i;
		if(level==2)
		{
				escadas_x[0] = 33;
				escadas_x[1] = 95;
				escadas_x[2] = 3;
				escadas_x[3] = 49;
			
				escadas_y[0] = 35;
				escadas_y[1] = 58;
				escadas_y[2] = 80;
				escadas_y[3] = 103;
				
				//enemies_side: 0=parado, 1=direita, 2=esquerda
				for(i=0; i<ENEMIES_COUNTER; i++){
						newEnemyPosition(i);
				}
				for(i=0; i<POINT_COUNTER; i++){
						newPointPosition(i);
				}
				
				Eddie_x = 115;
				Eddie_y = 124-EDDIE_HEIGHT;
				
				Boss_x = (128-MARGEM_ESQUERDA)/2+MARGEM_ESQUERDA;
				Boss_y = 33-BOSS_HEIGHT;
				Key_y = Boss_y - KEY_HEIGHT;
				Boss_side = 1;
				
				jumping = false;
				jumping_counter = 0;
				jumping_side = 0;
				going_up = false;
				going_up = false;
				going_up_counter = 0;
				going_down_counter = 0;
		}	
		InitializeBackGround();
}
void OnPause(){
		bool pause=true;
		GrContextForegroundSet(&sContext, ClrWhite);
		while(pause){
				pause = !button_read_debounce();
				GrStringDraw(&sContext,"Jump to start!", -1, (sContext.psFont->ui8MaxWidth)*4,  (sContext.psFont->ui8Height+2)*6, true);
		}

}
void GameOver(){
		char buf[10];
		uint16_t i,j;
		bool pause=true;
		GrContextForegroundSet(&sContext, ClrBlack);
		intToString(score, buf, 10, 10, 3);
		
		for (i=0; i<128; i++){
				for (j=0; j<128; j++){
						draw_pixel(i, j);
				}
		}
		GrContextForegroundSet(&sContext, ClrYellow);
		while(pause){
				pause = !button_read_debounce();
				GrStringDraw(&sContext,"Game Over", -1, (sContext.psFont->ui8MaxWidth)*6,  (sContext.psFont->ui8Height+2)*4, true);
				GrStringDraw(&sContext,"U LOSER", -1, (sContext.psFont->ui8MaxWidth)*7,  (sContext.psFont->ui8Height+2)*5, true);
				GrStringDraw(&sContext,"Maybe next time?", -1, (sContext.psFont->ui8MaxWidth)*2,  (sContext.psFont->ui8Height+2)*6, true);
				GrStringDraw(&sContext,"Score:", -1, (sContext.psFont->ui8MaxWidth)*5,  (sContext.psFont->ui8Height+2)*7, true);
				GrStringDraw(&sContext,buf, -1, (sContext.psFont->ui8MaxWidth)*13,  (sContext.psFont->ui8Height+2)*7, true);
		}
}
void GameWon(){
		char buf[10];
		uint16_t i,j;
		bool pause=true;
		GrContextForegroundSet(&sContext, ClrBlack);
		
		intToString(score, buf, 10, 10, 3);
		
		for (i=0; i<128; i++){
				for (j=0; j<128; j++){
						draw_pixel(i, j);
				}
		}
		GrContextForegroundSet(&sContext, ClrYellow);
		while(pause){
				pause = !button_read_debounce();
				GrStringDraw(&sContext,"YOU WON!", -1, (sContext.psFont->ui8MaxWidth)*6,  (sContext.psFont->ui8Height+2)*5, true);
				GrStringDraw(&sContext,"Congrats", -1, (sContext.psFont->ui8MaxWidth)*6,  (sContext.psFont->ui8Height+2)*6, true);
				GrStringDraw(&sContext,"Your Score:", -1, (sContext.psFont->ui8MaxWidth)*2,  (sContext.psFont->ui8Height+2)*7, true);
				GrStringDraw(&sContext,buf, -1, (sContext.psFont->ui8MaxWidth)*15,  (sContext.psFont->ui8Height+2)*7, true);
		}
}
void NextLevel(){
		char buf[10];
		uint16_t i,j;
		uint8_t timer_status;
		bool pause=true;
		//onPause = true;
		
		GrContextForegroundSet(&sContext, ClrBlack);
		for (i=0; i<128; i++){
				for (j=0; j<128; j++){
						draw_pixel(i, j);
				}
		}
		GrContextForegroundSet(&sContext, ClrWhite);
		
		level++;
		points=0;
		intToString(level, buf, 10, 10, 3);
		timer_status = osTimerStop(t_eddie);		
		timer_status = osTimerStop(t_enemies);		
		timer_status = osTimerStop(t_points);		
		timer_status = osTimerStop(t_boss);
		while(pause)
		{
				pause = !button_read_debounce();
				GrStringDraw(&sContext,"Next Level!", -1, (sContext.psFont->ui8MaxWidth)*5,  (sContext.psFont->ui8Height+2)*4, true);
				GrStringDraw(&sContext,buf, -1, (sContext.psFont->ui8MaxWidth)*9,  (sContext.psFont->ui8Height+2)*5, true);
				GrStringDraw(&sContext,"Jump to Continue!", -1, (sContext.psFont->ui8MaxWidth)*3,  (sContext.psFont->ui8Height+2)*6, true);
		}
		InitializeNewLevel();
		//onPause = false;
		timer_status = osTimerStart(t_eddie, TIMER_EDDIE);		
		timer_status = osTimerStart(t_enemies, TIMER_EDDIE);		
		timer_status = osTimerStart(t_points, TIMER_EDDIE);		
		timer_status = osTimerStart(t_boss, TIMER_EDDIE);
}

void GameController(){
		char pbufx[10], pbufy[10], pbufz[10];
		uint8_t id_enemy=10, id_point=10;
		uint8_t timer_status;
		bool boss_collision, key_collision;
		bool needPause = false;
		
		while(!game_over && !game_won)
		{
				//vira TIMER
				//EddieController();
				//EnemiesController();
				//PointsController();
				//BossController();
			
				//fica aqui msm 
				boss_collision = collisionBossController();
				key_collision = collisionKeyController();
				id_enemy =collisionEnemyController();
				id_point = collisionPointController();
				
				if(boss_collision || id_enemy!=10){	//boss_collision || id_enemy!=10
						if(lives>1){
								lives--;
								ResetEddie();
								newEnemyPosition(id_enemy);
								needPause = true;
						}
						else{game_over = true;}
					
				}
				if(id_point!=10){
						points++;
						score+=10;
						newPointPosition(id_point);
				}
				if(key_collision ){
						if(level<MAXLEVEL){
								points++;
								score+=300;
								NextLevel();
						}
						else{
								game_won = true;
						}	
				}
				
				GrContextBackgroundSet(&sContext, ClrBlack);
				intToString(lives, pbufx, 10, 10, 3);
				intToString(score, pbufy, 10, 10, 3);
				GrContextForegroundSet(&sContext, ClrRed);
				GrStringDraw(&sContext,"Lives:", -1, (sContext.psFont->ui8MaxWidth)*0,  (sContext.psFont->ui8Height+2)*0, true);
				GrStringDraw(&sContext,"Score", -1, (sContext.psFont->ui8MaxWidth)*10,  (sContext.psFont->ui8Height+2)*0, true);
				GrStringDraw(&sContext,(char*)pbufx, -1, (sContext.psFont->ui8MaxWidth)*6,  (sContext.psFont->ui8Height+2)*0, true);
				GrStringDraw(&sContext,(char*)pbufy, -1, (sContext.psFont->ui8MaxWidth)*16,  (sContext.psFont->ui8Height+2)*0, true);

			if(needPause){
					osDelay(100);
					needPause = false;
			}	
			if(points>=4){
					GrStringDraw(&sContext,"Get The Key, idiot!", -1, (sContext.psFont->ui8MaxWidth)*0,  (sContext.psFont->ui8Height+2)*1, true);
			}
			osDelay(500);
		}	
		//onPause = true;
		
		timer_status = osTimerStop(t_eddie);		
		timer_status = osTimerStop(t_enemies);		
		timer_status = osTimerStop(t_points);		
		timer_status = osTimerStop(t_boss);
		
		if(game_won){
				GameWon();
		}
		else{
			GameOver();
		}

}





